Repository: douxy1994/AI-Memory
Catalog: Windows/src/AIMemory.Windows/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# LanguageSystem
source: Use Windows language
zh_cn: 跟随 Windows

# AppDescription
source: Local memory, history, and continuation workbench across AI Agents
zh_cn: 跨 Agent 的本地记忆、历史和接续工作台

# LanguageRestartRequired
source: Restart AI Memory to apply the language change.
zh_cn: 语言更改将在重新启动 AI Memory 后生效。

# LanguageSavedRestartRequired
source: Language saved. Restart AI Memory to apply it.
zh_cn: 界面语言已保存；重新启动 AI Memory 后生效。

# LanguageSaveFailed
source: Could not save the language setting: {0}
zh_cn: 保存语言设置失败：{0}

# UpdateAvailableAtLaunch
source: AI Memory {0} is available. Open Settings to review and install it.
zh_cn: 发现 AI Memory {0}，请在设置中查看并安装。

# FontSystem
source: System default
zh_cn: 系统默认

# FontSourceSans
source: Noto Sans CJK SC
zh_cn: 思源黑体

# FontSourceSerif
source: Noto Serif CJK SC
zh_cn: 思源宋体

# FontWenkai
source: LXGW WenKai
zh_cn: 霞鹜文楷

# FontApplied
source: Applied {0}.
zh_cn: 已应用{0}。

# FontSaveFailed
source: Could not save the font setting: {0}
zh_cn: 保存字体设置失败：{0}

# DataDirectoryPath
source: Data folder: {0}
zh_cn: 数据目录：{0}

# StartupEnabled
source: Enabled
zh_cn: 已开启

# StartupDisabledByUser
source: Disabled by Windows or the user. You can restore it in Windows Settings.
zh_cn: 已被系统或用户禁用，可在 Windows 设置中恢复

# StartupDisabledByPolicy
source: Your organization’s policy prevents startup at login.
zh_cn: 组织策略禁止开机启动

# StartupDisabled
source: Disabled
zh_cn: 已关闭

source: Startup setting updated.
zh_cn: 启动设置已更新。

# StartupSettingFailed
source: Could not update the startup setting: {0}
zh_cn: 更新启动设置失败：{0}

# StartupSettingsLaunchRejected
source: Windows declined to open Startup Apps settings.
zh_cn: Windows 拒绝打开启动应用设置。

# StartupSettingsLaunchFailed
source: Could not open Startup Apps settings: {0}
zh_cn: 打开启动应用设置失败：{0}

# AutomaticBackupEnabled
source: Automatic backup is enabled and checks for changes every {0} minutes.
zh_cn: 自动备份已开启，每 {0} 分钟检查一次变化。

# AutomaticBackupDisabled
source: Automatic backup is disabled.
zh_cn: 自动备份已关闭。

# AutomaticBackupSaveFailed
source: Could not save automatic backup settings: {0}
zh_cn: 保存自动备份设置失败：{0}

# AutomaticRecoverySettingsSaved
source: Automatic memory recovery points and scheduled backup settings were saved.
zh_cn: 自动记忆恢复点与定时备份设置已保存。

# AgentIntegrationEnabled
source: {0} integration enabled.
zh_cn: {0} 集成已启用。

# AgentIntegrationDisabled
source: {0} integration disabled.
zh_cn: {0} 集成已关闭。

# AgentIntegrationUpdateFailed
source: Could not update the Agent integration: {0}
zh_cn: 更新 Agent 集成失败：{0}

source: Settings saved.
zh_cn: 设置已保存。

# SettingsSaveFailed
source: Could not save settings: {0}
zh_cn: 保存失败：{0}

# WebDavVerificationSucceeded
source: Connection verified (HTTP {0}).
zh_cn: 连接验证成功（HTTP {0}）。

# WebDavVerificationFailed
source: Connection verification failed: {0}
zh_cn: 连接验证失败：{0}

# SyncCompleted
source: Sync complete: {0} uploaded, {1} downloaded, {2} unchanged.
zh_cn: 同步完成：上传 {0}，下载 {1}，跳过 {2}。

# SyncProgressPreparing
source: Preparing incremental sync…
zh_cn: 正在准备增量同步…

# SyncProgressVerifying
source: Verifying the WebDAV connection…
zh_cn: 正在验证 WebDAV 连接…

# SyncProgressCounters
source: Sync progress: {0} uploaded, {1} downloaded, {2} unchanged.
zh_cn: 同步进度：已上传 {0}，已下载 {1}，已跳过 {2}。

# SyncProgressConversation
source: Processing {0} · {1}: {2} uploaded, {3} downloaded, {4} unchanged.
zh_cn: 正在处理 {0} · {1}：已上传 {2}，已下载 {3}，已跳过 {4}。

# SyncFailed
source: Sync failed: {0}
zh_cn: 同步失败：{0}

# RecoveryPointCreated
source: Recovery point created: {0}
zh_cn: 恢复点已创建：{0}

# RecoveryPointUnchanged
source: No data changed. Existing recovery point kept: {0}
zh_cn: 数据没有变化，已保留现有恢复点：{0}

# BackupFailed
source: Backup failed: {0}
zh_cn: 备份失败：{0}

# NoRecoveryPoints
source: No recovery points are available.
zh_cn: 没有可用的恢复点。

# RestoreRecoveryPointPrompt
source: The current database is backed up automatically before restoration. Choose a recovery point:
zh_cn: 恢复前会自动备份当前数据库。请选择要恢复的时间点：

# RestoreRecoveryPointTitle
source: Restore from Recovery Point
zh_cn: 从恢复点恢复

source: Restore
zh_cn: 恢复

source: Cancel
zh_cn: 取消

# RestoreCompleted
source: Restore complete. Pre-restore data was backed up to: {0}
zh_cn: 恢复完成；恢复前的数据已备份到：{0}

# RestoreFailed
source: Restore failed: {0}
zh_cn: 恢复失败：{0}

source: Local sync folder saved.
zh_cn: 本地同步目录已保存。

# LocalSyncFolderSaveFailed
source: Could not save the local sync folder: {0}
zh_cn: 保存本地同步目录失败：{0}

# LocalSyncCompleted
source: Local sync complete: {0} uploaded, {1} downloaded, {2} unchanged.
zh_cn: 本地同步完成：上传 {0}，下载 {1}，跳过 {2}。

# LocalSyncFailed
source: Local sync failed: {0}
zh_cn: 本地同步失败：{0}

# ChatMemDatabaseNotFound
source: No ChatMem database is available to import.
zh_cn: 没有找到可导入的 ChatMem 数据库。

# ChatMemSourceDetected
source: Detected ChatMem database: {0}. You can still choose a different database after selecting Import.
zh_cn: 已检测到 ChatMem 数据库：{0}。点击“导入”后仍可选择其他数据库文件。

# ChatMemSourceNotDetected
source: No ChatMem database was detected automatically. Select Import to choose a .db, .sqlite, or .sqlite3 file manually.
zh_cn: 未自动检测到 ChatMem 数据库；仍可点击“导入”手动选择 .db、.sqlite 或 .sqlite3 文件。

# ChooseChatMemDatabaseTitle
source: Choose a ChatMem Database
zh_cn: 选择 ChatMem 数据库

# ChooseChatMemDatabaseCommit
source: Import
zh_cn: 导入

# ChooseChatMemDatabaseFailed
source: Could not choose the ChatMem database: {0}
zh_cn: 选择 ChatMem 数据库失败：{0}

# ChatMemImportConfirmTitle
source: Import This Database?
zh_cn: 导入这个数据库？

# ChatMemImportConfirmBody
source: Source: {0} AI Memory will copy the source read-only, then validate and migrate the copy. The current AI Memory database is backed up before it is atomically replaced.
zh_cn: 来源：{0} AI Memory 将以只读方式复制来源，校验并迁移副本。当前 AI Memory 数据库会先建立可恢复备份，再以原子方式替换。

# ChatMemImportConfirmAction
source: Import
zh_cn: 导入

# ChatMemImportInProgress
source: Importing and validating ChatMem data…
zh_cn: 正在从 ChatMem 导入并校验数据…

# ChatMemImportCompleted
source: ChatMem data imported.
zh_cn: ChatMem 数据已导入。

# ChatMemImportCompletedWithBackup
source: ChatMem data imported. Original data backup: {0}
zh_cn: ChatMem 数据已导入，原数据备份：{0}

# ChatMemWebDavImported
source: Imported the WebDAV profile and credential from ChatMem.
zh_cn: 已从 ChatMem 导入 WebDAV 配置与凭据。

# ChatMemWebDavImportedWithoutUsername
source: Imported the ChatMem WebDAV address, but the original profile has no username.
zh_cn: 已导入 ChatMem 的 WebDAV 地址，但原配置没有用户名。

# ChatMemWebDavImportedWithoutPassword
source: Imported the ChatMem WebDAV address, but no password was found in its credential store or settings. Add it in Settings.
zh_cn: 已导入 ChatMem 的 WebDAV 地址；原凭据库与设置中未找到密码，请在设置中补充。

# ChatMemWebDavImportFailed
source: Could not import the ChatMem WebDAV profile: {0}
zh_cn: 导入 ChatMem WebDAV 配置失败：{0}

# ImportFailed
source: Import failed: {0}
zh_cn: 导入失败：{0}

# NativeHistoryImportCompleted
source: Local history import complete: {0}.
zh_cn: 本机历史导入完成：{0}。

# NativeHistoryImportCompletedWithWarnings
source: Local history import complete: {0}; {1} warnings.
zh_cn: 本机历史导入完成：{0}；{1} 项警告。

# NativeHistoryImportFailed
source: Local history import failed: {0}
zh_cn: 本机历史导入失败：{0}

source: Update settings saved.
zh_cn: 更新设置已保存。

# UpdateSettingsSaveFailed
source: Could not save update settings: {0}
zh_cn: 保存更新设置失败：{0}

# OpenedAboutCheckingUpdates
source: Opened About AI Memory and started checking for updates.
zh_cn: 已打开“关于 AI Memory”并开始检查更新。

# DiagnosticsReadFailed
source: Could not read diagnostics: {0}
zh_cn: 读取诊断失败：{0}

source: Diagnostics copied.
zh_cn: 诊断信息已复制。

# UpgradeReadinessPassed
source: Upgrade readiness check passed.
zh_cn: 升级就绪检查通过。

# UpgradeReadinessWarnings
source: Found {0} items to review.
zh_cn: 发现 {0} 个需要处理的项目。

# UpgradeReadinessErrors
source: Found {0} blocking issues.
zh_cn: 发现 {0} 个阻断问题。

# UpgradeReadinessFailed
source: Upgrade readiness check failed: {0}
zh_cn: 升级就绪检查失败：{0}

# ReadinessSettingsLabel
source: Native Settings File
zh_cn: 原生设置文件

# ReadinessWebDavProfileLabel
source: WebDAV Configuration
zh_cn: WebDAV 配置

# ReadinessWebDavPasswordLabel
source: WebDAV Password
zh_cn: WebDAV 密码

# ReadinessDatabaseLabel
source: Memory Database
zh_cn: 记忆数据库

# ReadinessUnknownLabel
source: Unknown Check
zh_cn: 未知检查项

# ReadinessSettingsParsed
source: The settings file exists and can be parsed.
zh_cn: 设置文件存在且可以解析。

# ReadinessSettingsDefaults
source: No settings file exists yet; safe defaults are in use.
zh_cn: 尚未生成设置文件；当前使用安全默认值。

# ReadinessSettingsInvalid
source: The settings file cannot be parsed: {0}
zh_cn: 设置文件无法解析：{0}

# ReadinessWebDavComplete
source: The server, username, and remote folder are configured.
zh_cn: 服务器、用户名和远程目录均已配置。

# ReadinessWebDavIncomplete
source: WebDAV is enabled, but the server, username, or remote folder is incomplete.
zh_cn: WebDAV 已启用，但服务器、用户名或远程目录不完整。

# ReadinessWebDavDisabled
source: WebDAV sync is not currently enabled.
zh_cn: 当前未启用 WebDAV 同步。

# ReadinessPasswordPresent
source: The password exists in Windows Credential Locker.
zh_cn: 密码存在于 Windows 凭据保险箱。

# ReadinessPasswordMissing
source: No matching password exists in Credential Locker. Enter it again and verify the server.
zh_cn: 凭据保险箱中没有对应密码，请重新输入并验证服务器。

# ReadinessPasswordUnavailable
source: Windows Credential Locker could not be read: {0}
zh_cn: 无法读取 Windows 凭据保险箱：{0}

# ReadinessPasswordNotRequired
source: The current sync mode does not require a WebDAV password.
zh_cn: 当前同步模式不需要 WebDAV 密码。

# ReadinessDatabaseValid
source: The database opens successfully and schema version {0} is valid.
zh_cn: 数据库可以打开，结构版本 {0} 有效。

# ReadinessDatabaseInvalid
source: The database could not be validated: {0}
zh_cn: 数据库无法验证：{0}

# ReadinessUnknownDetail
source: No check details are available.
zh_cn: 没有可用的检查详情。

# DataDirectory
source: the data folder
zh_cn: 数据目录

# BackupDirectory
source: the backup folder
zh_cn: 备份目录

# WindowsCannotOpenLocation
source: Windows could not open {0}.
zh_cn: Windows 无法打开{0}。

# OpenLocationFailed
source: Could not open {0}: {1}
zh_cn: 打开{0}失败：{1}

# AutomaticBackupRunFailed
source: Automatic backup failed: {0}
zh_cn: 自动备份失败：{0}

source: Refreshing all sources…
zh_cn: 正在刷新全部来源…

# SourcesRefreshCompleted
source: Source refresh complete: {0}.
zh_cn: 来源刷新完成：{0}。

# SourcesRefreshCompletedWithWarnings
source: Source refresh complete: {0}; {1} warnings.
zh_cn: 来源刷新完成：{0}；{1} 项警告。

# SourcesRefreshFailed
source: Could not refresh sources: {0}
zh_cn: 刷新来源失败：{0}

# SyncingChanges
source: Syncing changed content…
zh_cn: 正在同步变化内容…

# ConfigureSyncFirst
source: Configure a sync service in Data Sync & Backup first.
zh_cn: 请先在“数据同步与备份”中配置同步服务。

# HelpTitle
source: AI Memory Help
zh_cn: AI Memory 帮助

# HelpContent
source: Ctrl+1 Return to Workbench Ctrl+2 Open Memory and Review Queue Ctrl+3 Open History Ctrl+R Refresh All Sources Ctrl+Shift+S Incremental Sync Ctrl+, Open Settings
zh_cn: Ctrl+1 返回工作台 Ctrl+2 打开记忆与待复核 Ctrl+3 打开历史 Ctrl+R 刷新全部来源 Ctrl+Shift+S 增量同步 Ctrl+, 打开设置

source: Done
zh_cn: 完成

source: Uninstall All
zh_cn: 全部卸载

# AgentUninstallAllTitle
source: Uninstall all Agent integrations?
zh_cn: 卸载全部 Agent 集成？

# AgentUninstallAllDescription
source: Only AI Memory-managed MCP entries, skills, and startup rules are removed. Agents, history, and memory data remain intact.
zh_cn: 只移除 AI Memory 管理的 MCP、skill 和启动规则，不删除 Agent、历史或记忆数据。

# NoEligibleAgentIntegrations
source: No installed Agent integration can perform this operation.
zh_cn: 当前没有可执行该操作的已安装 Agent 集成。

# AgentBulkInstallCompleted
source: Installed or repaired {0} Agent integrations.
zh_cn: 已安装或修复 {0} 项 Agent 集成。

# AgentBulkUninstallCompleted
source: Uninstalled {0} Agent integrations.
zh_cn: 已卸载 {0} 项 Agent 集成。

# AgentBulkPartialFailure
source: {0} {1} failed: {2}
zh_cn: {0} 失败 {1} 项：{2}

# ChooseSyncFolderTitle
source: Choose a Local Sync Folder
zh_cn: 选择本地同步目录

# ChooseSyncFolderCommit
source: Choose
zh_cn: 选择

# ChooseSyncFolderFailed
source: Could not choose the sync folder: {0}
zh_cn: 选择同步目录失败：{0}

# CloudFolderMissing
source: The sync folder does not exist. Choose it again.
zh_cn: 同步目录不存在，请重新选择。

# CloudFolderReady
source: The cloud folder is idle and ready to sync.
zh_cn: 云盘目录当前空闲，可以安全同步。

# CloudFolderBusyWithLocks
source: Cloud lock or temporary files were found. Try again later.
zh_cn: 检测到云盘锁文件或临时文件，建议稍后再试。

# CloudFolderRecentlyChanged
source: The cloud folder changed recently. Wait a few seconds before syncing.
zh_cn: 云盘目录刚刚发生变化，建议等待数秒后再同步。

# CloudReadinessCheckFailed
source: Could not check cloud readiness: {0}
zh_cn: 检测云盘状态失败：{0}

# TrayOpen
source: Open AI Memory
zh_cn: 打开 AI Memory

# TraySyncNow
source: Sync Now
zh_cn: 立即同步

# TrayExit
source: Exit AI Memory
zh_cn: 退出 AI Memory

# AboutWindowTitle
source: About AI Memory
zh_cn: 关于 AI Memory

# ReleaseVersion
source: Release {0}
zh_cn: 正式版本 {0}

# DevelopmentVersion
source: Development {0}
zh_cn: 开发版本 {0}

# AgentCoverage
source: ✓ Broader Agent coverage Detects {0} popular Agents and CLIs, with installed products shown first.
zh_cn: ✓ Agent 覆盖扩展 支持 {0} 种主流 Agent 与 CLI 检测，已安装项目优先显示。

# CheckingUpdates
source: Checking…
zh_cn: 正在检查…

source: Checking GitHub Releases…
zh_cn: 正在检查 GitHub Releases…

# CurrentVersionLatest
source: You are up to date. The newest release is {0}.
zh_cn: 当前版本已是最新；更新源最新版本为 {0}。

# AlreadyLatestTitle
source: AI Memory Is Up to Date
zh_cn: AI Memory 已是最新版本

# AlreadyLatestBody
source: Version {0} is the latest version.
zh_cn: 当前版本 {0} 已是最新版本。

# CannotCheckUpdatesTitle
source: Unable to Check for Updates
zh_cn: 无法检查更新

# NewVersionFound
source: New version {0}: {1}
zh_cn: 发现新版本 {0}：{1}

# DownloadingNewVersion
source: Version {0} is available. Downloading the installer…
zh_cn: 发现新版本 {0}，正在下载安装包…

# WindowsCannotOpenInstaller
source: Windows could not open the installer.
zh_cn: Windows 无法打开安装包。

# InstallerLaunched
source: The installer was downloaded and opened with Windows Installer.
zh_cn: 安装包已下载并交给 Windows 安装器。

# UpdateCheckFailed
source: Update check failed: {0}
zh_cn: 检查更新失败：{0}

source: Check for Updates
zh_cn: 检查更新

source: Uncommitted build
zh_cn: 未提交构建

# AgentStateIntegratedDetail
source: AI Memory integration is enabled.
zh_cn: AI Memory 集成已启用。

# AgentStatePartialDetail
source: The AI Memory integration is only partially installed. Enable it to repair automatically.
zh_cn: AI Memory 集成仅部分安装；点击启用可自动修复。

# AgentStateDetectedManualDetail
source: Installed locally. A safe automatic configuration format is not available.
zh_cn: 已检测到本机安装；暂无安全自动配置格式。

# AgentStateDetectedDetail
source: Installed locally. AI Memory integration is not enabled yet.
zh_cn: 已检测到本机安装；尚未启用 AI Memory 集成。

# AgentStateMissingDetail
source: Not installed locally, so it remains disabled.
zh_cn: 本机未安装，默认不启用。

# AgentStateIntegrated
source: Integrated
zh_cn: 已集成

# AgentStatePartial
source: Repair needed
zh_cn: 待修复

# AgentStateDetected
source: Installed
zh_cn: 已安装

# AgentStateMissing
source: Not installed
zh_cn: 未安装

source: Enable
zh_cn: 启用

source: Disable
zh_cn: 关闭

# DetectedAgentSummary
source: {0} of {1} installed; installed products appear first.
zh_cn: {0} / {1} 项已安装；已安装项目优先显示。

source: All sources
zh_cn: 全部来源

# RefreshCompletedTitle
source: Refresh Complete
zh_cn: 刷新完成

# RefreshCompletedBody
source: Reloaded the local database and Agent installation status.
zh_cn: 已重新读取本地数据库和 Agent 安装状态。

# ComputerGroupsTitle
source: Computer Groups
zh_cn: 电脑分组

# NoProjectsToManage
source: There are no projects to manage.
zh_cn: 当前没有可管理的项目。

# ComputerGroupsDescription
source: Rename computers or move projects into another computer group. This changes only how AI Memory displays them and does not modify original paths.
zh_cn: 重命名电脑，或把项目移动到另一个电脑分组。这里只改变 AI Memory 的展示，不修改原始路径。

source: Computer name
zh_cn: 电脑名称

source: Do not merge
zh_cn: 不合并

source: Merge computer
zh_cn: 合并电脑

# ProjectConversationCount
source: {0} · {1} conversations
zh_cn: {0} · {1} 条

source: Assigned computer
zh_cn: 所属电脑

source: Manage Computer Groups
zh_cn: 管理电脑分组

source: Save
zh_cn: 保存

source: Restore Automatic Grouping
zh_cn: 恢复自动分组

# AutomaticGroupingRestored
source: Automatic grouping by project path was restored.
zh_cn: 已恢复按项目路径自动分组。

# ComputerGroupsSaved
source: Computer names and project groups saved.
zh_cn: 电脑名称和项目分组已保存。

# SyncCompletedTitle
source: Sync Complete
zh_cn: 同步完成

# SyncFailedTitle
source: Sync Failed
zh_cn: 同步失败

# SyncTitle
source: Sync
zh_cn: 同步

# ConfigureWebDavFirst
source: Configure WebDAV in Settings first.
zh_cn: 请先在设置中完成 WebDAV 配置。

source: Unknown project
zh_cn: 未知项目

source: Untitled conversation
zh_cn: 未命名对话

# ConversationCount
source: {0} conversations
zh_cn: {0} 条

source: Not provided
zh_cn: 未提供

source: Favorite
zh_cn: 收藏

source: Remove Favorite
zh_cn: 取消收藏

# ConversationFavorited
source: Conversation added to Favorites.
zh_cn: 对话已收藏。

# ConversationUnfavorited
source: Conversation removed from Favorites.
zh_cn: 已取消收藏。

# FavoriteUpdateFailed
source: Could not update the favorite: {0}
zh_cn: 更新收藏失败：{0}

source: Project path copied.
zh_cn: 项目路径已复制。

source: Resume command copied.
zh_cn: 恢复命令已复制。

# FullConversationCopy
source: Copy full conversation
zh_cn: 完整对话复制

# SummaryMigration
source: Summary migration (copy continuation card)
zh_cn: 总结式迁移（复制继续卡片）

source: Target Agent
zh_cn: 目标 Agent

source: Copy (keep source)
zh_cn: 复制（保留源）

# MoveAfterVerification
source: Move (trash source after verification)
zh_cn: 移动（验证后将源移入回收站）

# CopySourceCannotMove
source: Copy (this source cannot be moved safely)
zh_cn: 复制（此来源不支持安全移动）

# FullMigrationDescription
source: Full migration writes to the target Agent’s real local history and rolls back if read-back verification fails.
zh_cn: 完整迁移会写入目标 Agent 的真实本地历史，并在回读验证失败时撤销写入。

source: Migrate Conversation
zh_cn: 迁移对话

source: Continue
zh_cn: 继续

source: Continuation card copied.
zh_cn: 继续卡片已复制。

# NoSafeWritableAgent
source: No safely writable target Agent was detected.
zh_cn: 没有检测到可安全写入的目标 Agent。

# SelectTargetAgent
source: Select a target Agent.
zh_cn: 请选择目标 Agent。

# MigrationMoveSucceeded
source: Moved to {0}. The source conversation is now in Trash.
zh_cn: 移动成功：{0} · 源对话已进入回收站

# MigrationSucceeded
source: Migrated to {0} · {1}…
zh_cn: 迁移成功：{0} · {1}…

# MigrationFailed
source: Migration failed: {0}
zh_cn: 迁移失败：{0}

# MoveToTrashQuestion
source: Move to Trash?
zh_cn: 移到回收站？

# MoveToTrashDescription
source: The conversation is removed from the AI Memory database and a recoverable copy is retained.
zh_cn: 对话会从 AI Memory 数据库移除，并保留可恢复副本。

source: Move to Trash
zh_cn: 移到回收站

# MoveToTrashFailed
source: Could not move the conversation to Trash: {0}
zh_cn: 移到回收站失败：{0}

source: Checkpoint created.
zh_cn: 检查点已创建。

# CheckpointCreationFailed
source: Could not create the checkpoint: {0}
zh_cn: 创建检查点失败：{0}

# HandoffCreated
source: Created a handoff for {0}.
zh_cn: 已创建发往 {0} 的交接包。

# HandoffCreationFailed
source: Could not create the handoff: {0}
zh_cn: 创建交接失败：{0}

source: Favorite unpinned.
zh_cn: 已取消置顶。

source: Favorite pinned.
zh_cn: 收藏已置顶。

# FavoritePinUpdateFailed
source: Could not update the pin state: {0}
zh_cn: 更新置顶状态失败：{0}

# FavoriteMetadataSaved
source: Favorite note and tags saved.
zh_cn: 收藏备注与标签已保存。

# FavoriteSaveFailed
source: Could not save the favorite: {0}
zh_cn: 保存收藏失败：{0}

# FavoriteSourceUnavailable
source: The original conversation is unavailable. The favorite snapshot is retained.
zh_cn: 原始对话当前不可用；收藏快照仍会保留。

# FavoriteCardCopied
source: Favorite continuation card copied.
zh_cn: 收藏继续卡片已复制。

source: Pinned
zh_cn: 已置顶

source: Unpin
zh_cn: 取消置顶

source: Pin
zh_cn: 置顶

source: Title
zh_cn: 标题

source: Rule content
zh_cn: 规则内容

source: Usage hint
zh_cn: 使用提示

source: Approve Candidate Rule
zh_cn: 批准候选规则

source: Approve
zh_cn: 批准

# CandidateApproved
source: Candidate approved and written to project memory.
zh_cn: 候选已批准并写入项目记忆。

# ApprovalFailed
source: Approval failed: {0}
zh_cn: 批准失败：{0}

source: Candidate snoozed.
zh_cn: 候选已暂缓。

# CandidateRejected
source: Candidate rejected. Its evidence is retained.
zh_cn: 候选已拒绝，证据仍保留。

# CandidateUpdateFailed
source: Could not update the candidate: {0}
zh_cn: 更新候选失败：{0}

source: Edit Approved Rule
zh_cn: 编辑已批准规则

source: Rule updated.
zh_cn: 规则已更新。

source: Rule reverified.
zh_cn: 规则已重新验证。

source: Rule disabled.
zh_cn: 规则已停用。

# RuleUpdateFailed
source: Could not update the rule: {0}
zh_cn: 更新规则失败：{0}

source: Target profile (optional)
zh_cn: 目标配置（可选）

source: Create Handoff
zh_cn: 创建交接包

source: Create
zh_cn: 创建

# HandoffConsumed
source: Handoff marked as consumed.
zh_cn: 交接包已标记为已消费。

# HandoffUpdateFailed
source: Could not update the handoff: {0}
zh_cn: 更新交接包失败：{0}

# TrashSummaryWithCount
source: {0} recoverable deleted conversations, retained for {1:0} days.
zh_cn: 已删除对话的可恢复记录（{0} 条，保留 {1:0} 天）。

# TrashSummaryRetention
source: Recoverable deleted conversations are retained for {0} days.
zh_cn: 已删除对话的可恢复记录（保留 {0} 天）。

# TrashRetentionUpdated
source: Trash retention period updated.
zh_cn: 回收站保留天数已更新。

# EmptyTrashQuestion
source: Empty Trash?
zh_cn: 清空回收站？

# EmptyTrashDescription
source: This permanently deletes all {0} Trash records and cannot be undone.
zh_cn: 将永久删除全部 {0} 条回收站记录，此操作无法撤销。

source: Empty Permanently
zh_cn: 永久清空

# TrashRecordsDeleted
source: Permanently deleted {0} Trash records.
zh_cn: 已永久删除 {0} 条回收站记录。

# EmptyTrashFailed
source: Could not empty Trash: {0}
zh_cn: 清空回收站失败：{0}

source: Conversation restored.
zh_cn: 对话已恢复。

# DeletePermanentlyQuestion
source: Delete Permanently?
zh_cn: 永久删除？

# CannotUndo
source: This action cannot be undone.
zh_cn: 此操作无法撤销。

source: Delete Permanently
zh_cn: 永久删除

# TrashRecordDeleted
source: Trash record permanently deleted.
zh_cn: 回收站记录已永久删除。

# DeletePermanentlyFailed
source: Permanent deletion failed: {0}
zh_cn: 永久删除失败：{0}

source: History refreshed.
zh_cn: 历史已刷新。

# HandoffSourceCheckpointUnavailable
source: This handoff has no available source checkpoint.
zh_cn: 该交接包没有可用的来源检查点。

# HistorySourceUnavailable
source: The source conversation is unavailable. The history entry is retained.
zh_cn: 来源对话当前不可用；历史条目仍会保留。

# SelectConversationToTrash
source: Select a conversation to move to Trash.
zh_cn: 请先选择要移到回收站的对话。

source: All Projects
zh_cn: 全部项目

# ProjectsSelected
source: {0} Projects Selected
zh_cn: 已选 {0} 个项目

# SortRecentlyUpdated
source: Recently Updated
zh_cn: 最近更新

# SortRecentlyCreated
source: Recently Created
zh_cn: 最近创建

# SortByTitle
source: Title
zh_cn: 标题

# ArrangeByProject
source: By Project
zh_cn: 按项目

# ArrangeTimeline
source: Timeline
zh_cn: 时间线

# HistoryTrashSelectedCount
source: Move to Trash ({0})
zh_cn: 移到回收站（{0}）

# MoveConversationsToTrashQuestion
source: Move {0} selected conversations to Trash?
zh_cn: 将选中的 {0} 条对话移到回收站？

# MoveConversationsToTrashDescription
source: Recoverable snapshots will be retained for {0} days. Nothing is permanently deleted.
zh_cn: 对话会保留可恢复快照 {0} 天，不会永久删除。

source: Move to Trash (Recoverable)
zh_cn: 移到回收站（可恢复）

# ConversationsMovedToTrash
source: Moved {0} conversations to Trash.
zh_cn: 已将 {0} 条对话移到回收站。

# BulkTrashCompletedWithFailures
source: Bulk operation completed: {0} moved to Trash and {1} failed.
zh_cn: 批量处理完成：{0} 条已移入回收站，{1} 条失败。

# MenuFile.Title
source: File
zh_cn: 文件

# MenuImportChatMem.Text
source: Import from ChatMem…
zh_cn: 从 ChatMem 导入…

# MenuCloseWindow.Text
source: Close Window
zh_cn: 关闭窗口

# MenuWorkbench.Title
source: Workbench
zh_cn: 工作台

# MenuReturnWorkbench.Text
source: Return to Workbench
zh_cn: 返回工作台

# MenuReview.Text
source: Review Queue
zh_cn: 待复核

# MenuHistory.Text
source: History
zh_cn: 历史

# MenuMemory.Text
source: Memory
zh_cn: 记忆

# MenuSyncNow.Text
source: Sync Now
zh_cn: 立即同步

# MenuRefreshSources.Text
source: Refresh All Sources
zh_cn: 刷新全部来源

# MenuWindow.Title
source: Window
zh_cn: 窗口

# MenuBack.Text
source: Back
zh_cn: 返回上一页

# MenuSettings.Text
source: Settings
zh_cn: 设置

# MenuHelp.Title
source: Help
zh_cn: 帮助

# MenuHelpItem.Text
source: AI Memory Help
zh_cn: AI Memory 帮助

# MenuAbout.Text
source: About AI Memory
zh_cn: 关于 AI Memory
